Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/ПубликацииВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПубликацииВебКабинетаСУ</name>
  <attributes>
    <name>АдресВебСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацииИБ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПубликацийРесурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКабинета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаФайлов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресКаталогаКартинок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛоготипа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПользовательУказанВПубликацииИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСлужебногоПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНовостиСтарее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаПользователи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВебСервисаЭР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервисаЭлектронныхКурсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСвободнаяРегистрация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыРегистрации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноВосстановлениеПароля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтраницыВосстановленияПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаСтандартнаяАутентификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияCAS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервисаCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИконкаСервераCAS</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенСписокОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенКалендарьОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытоеОбучение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныРезультатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныСертификатыОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСтатусОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаКарточкаОбучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКалендаря</name>
    <type>
      <types>EnumRef.ВариантыКалендаряВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаОтправкаЛичныхСообщенийИзКарточкиПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлектронныеРесурсыОбученияВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрыватьЭлементыБиблиотекиВНовомОкне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьКоличествоЭлементовРазделаБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРолиПреподавателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПользователейОнлайнВМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПинКодыДляРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступнаАутентификацияOpenID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПровайдераOpenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьАутентификациюПровайдераOpenIDПриВыходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьАутентификациюПровайдераOpenIDПослеЗагрузкиСтраниц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПоискПоЭлектроннымРесурсам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>EnumRef.ЯзыкиВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенРазделПроверкиЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижнийКолонтитул</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйКаталогПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЕдинственнаяПубликацияВОбщемКаталоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>EnumRef.РедакцииВебКабинетаСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикЯндексМетрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСервисаSentry</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСведенияВКонсоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенноеЧислоМинутНеактивности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьПинКодыНаГлавнойСтранице</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастотаСбораСтатистики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбразецЗаполненияПоляИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазместитьСсылкуРегистрацииСверху</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьФотографиюПрофиля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьКонтактнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьДополнительнуюИнформациюВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьИзменятьНастройкиРассылокВПрофиле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаОтзывОтветаНаЗадание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОформлениеКомандыПрофиля</name>
    <type>
      <types>EnumRef.ВариантыОформленияКомандыПрофиляВебКабинетаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВФорматеExcel</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноОткрытиеОтчетаВКабинете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключитьОтчеты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступенПолныйСписокОтчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьПустыеПапкиБиблиотеки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иконка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страница</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПублично</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступенПослеАвторизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроверятьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляРегистрации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>EnumRef.ВидыПолейРегистрацииВебКабинетаСУО</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоля</name>
      <type>
        <types>EnumRef.ТипыПолейРегистрацииВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактнаяИнформация</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавлятьПолеПодтверждения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательное</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодтверждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКакЛогин</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмещениеОтчетов</name>
    <attributes>
      <name>Отчет</name>
      <type>
        <types>CatalogRef.ВариантыОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияОтчетовВебКабинетаСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппировкиОбучений</name>
    <attributes>
      <name>Группировка</name>
      <type>
        <types>EnumRef.ГруппировкиОбученийВебКабинетаСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_ru</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование_en</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ПубликацииВебКабинетаСУ/Forms/МастерРучнойНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Делаем проверки
	//
	
	ПутьКОбщемуКаталогу = ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу();
	
	Если НЕ ЗначениеЗаполнено(ПутьКОбщемуКаталогу) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияСУПовтИсп.ТекстОНеобходимостиНастроитьОбщийКаталог(),,,,Отказ);
		Возврат;
	КонецЕсли;		
	
	// Пути к файлам
	//
	
	ПутьКФайламКабинета = ВебКабинетСУ.ПутьККаталогуУстановки(ПутьКОбщемуКаталогу);	
	
	ПутьККаталогуЭР = ЭлектронныеРесурсыСУЗКлиентСервер.ПутьККаталогуЭлектронныхРесурсов(ПутьКОбщемуКаталогу);
	
	
	// Начальные значения реквизитов
	//
	
	ИспользоватьПоУмолчанию = Истина;
	
	Справочники.ПубликацииВебКабинетаСУ.ЗаполнитьОбъектНачальнымиДанными(Объект);
	
	Объект.Наименование = "localhost";
	Объект.АдресВебСервера = "http://localhost";	
	Объект.АдресПубликации = "/edu";
	
	Объект.АдресПубликацииИБ = Объект.АдресПубликации + "/admin";
	
	Объект.АдресКаталогаКабинета = Объект.АдресПубликации + "/cabinet";
	Объект.АдресПубликацийРесурсов =  Объект.АдресПубликации + "/res";	
	Объект.АдресКаталогаФайлов =  Объект.АдресПубликации + "/files";	
	
	Объект.АдресСервисаОбучения = Объект.АдресПубликацииИБ + "/hs/cabinet";
	Объект.АдресСервисаПользователи = Объект.АдресПубликацииИБ + "/hs/users";
	Объект.АдресСервисаЭР = Объект.АдресПубликацииИБ + "/hs/res";
	Объект.АдресСервисаЭлектронныхКурсов = Объект.АдресПубликацииИБ + "/hs/courses";
	Объект.АдресВебСервисаЭР = Объект.АдресПубликацииИБ + "/ws/res.1cws";

	
	// Устанавливаем доступность элементов формы
	//
	
	// Примечание: установка видимости элементов для конструктора курсов
	Справочники.ПубликацииВебКабинетаСУ.УстановитьНачальнуюДоступностьЭлементовФормыПубликации(ЭтотОбъект, Элементы);
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИспользоватьПоУмолчанию", ИспользоватьПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура АдресПубликацииИБПриИзменении(Элемент)
	
	Объект.АдресСервисаОбучения = Объект.АдресПубликацииИБ + "/hs/cabinet";
	Объект.АдресСервисаПользователи = Объект.АдресПубликацииИБ + "/hs/users";
	Объект.АдресСервисаЭР = Объект.АдресПубликацииИБ + "/hs/res";
	Объект.АдресСервисаЭлектронныхКурсов = Объект.АдресПубликацииИБ + "/hs/courses";
	Объект.АдресВебСервисаЭР = Объект.АдресПубликацииИБ + "/ws/res.1cws";

КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииПриИзменении(Элемент)
	
	Объект.АдресКаталогаКабинета = Объект.АдресПубликации + "/cabinet";
	Объект.АдресПубликацийРесурсов =  Объект.АдресПубликации + "/res";
	Объект.АдресКаталогаФайлов = Объект.АдресПубликации + "/files";

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Переходы

&НаКлиенте
Процедура ОткрытьСтраницуСозданияКаталогаПубликации(Команда)
	
	Если ЗначениеЗаполнено(Объект.РегистрационныйНомер) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияКаталогаПубликации;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Укажите регистрационный номер продукта'"));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуСозданияКаталогаКабинета(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияФункциональныхКаталогов;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтартовуюСтраницу(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСтартовая;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуПубликацииИБ(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияФункциональныхКаталогов Тогда		
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресКаталогаКабинета) + "index.html";		
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);		
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПубликацияИБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтраницуНастройкиСлужебногоПользователя(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПубликацияИБ Тогда		
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресПубликацииИБ);
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);		
	КонецЕсли;	
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкаСлужебногоПользователя;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФинальнуюСтраницу(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНастройкаСлужебногоПользователя Тогда
		АдресТестовогоФайла = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Объект.АдресВебСервера + Объект.АдресСервисаОбучения) + "version";
		ПроверитьДоступностьВебАдреса(АдресТестовогоФайла);				
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаФинальная;
	
КонецПроцедуры

// Функциональные

&НаКлиенте
Процедура СоздатьСлужебногоПользователя(Команда)
	ПользовательСоздан = Ложь;
	СоздатьСлужебногоПользователяНаСервере(ПользовательСоздан);
	Если ПользовательСоздан Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Пользователь успешно создан'"));
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура СоздатьСлужебногоПользователяНаСервере(ПользовательСоздан = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛогинСлужебногоПользователя) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите логин пользователя'"),,"ЛогинСлужебногоПользователя", "ЛогинСлужебногоПользователя");
		Возврат;
	КонецЕсли;
	
	Пользователь = Пользователи.НайтиПоИмени(Объект.ЛогинСлужебногоПользователя);
	
	Если Пользователь = Неопределено Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Пользователь с таким именем уже существует'"));
		Возврат;
	КонецЕсли;
	
	ПользовательОбъект.Наименование = Объект.ЛогинСлужебногоПользователя;	
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Вставить("Действие", "Записать");
	ОписаниеПользователяИБ.Вставить("ВходВПрограммуРазрешен", Истина);
	
	ОписаниеПользователяИБ.Пароль = Объект.ПарольСлужебногоПользователя;
	ОписаниеПользователяИБ.Имя = Объект.ЛогинСлужебногоПользователя;
	ОписаниеПользователяИБ.ПолноеИмя = Объект.ЛогинСлужебногоПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Ложь;
	
	
	//--# КОНСТРУКТОР КУРСОВ ДОБАВИТЬ #--//
	
	// МассивРолей = Новый Массив;
	// МассивРолей.Добавить("ВебКабинетСлужебныйПользовательСУ"); 
	//
	// ОписаниеПользователяИБ.Роли = МассивРолей;	
	
		
	//----------------------------------//
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить(
		"ОписаниеПользователяИБ", ОписаниеПользователяИБ);
	
	ПользовательОбъект.ДополнительныеСвойства.Вставить("ЗапретитьУстановкуГруппыДоступаДляНовыхПользователей", Истина);
	
	ПользовательОбъект.Записать();	
	
	УправлениеДоступомСлужебный.ВключитьПользователяВГруппуДоступа(ПользовательОбъект.Ссылка, "3968e7c4-03ab-11e5-be5c-f0def149b112");	
	
	// Завершаем
	
	ПользовательСоздан = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы() Экспорт
	
	Элементы.КомандаПолучитьФайлНастроек.Доступность = НЕ Объект.Ссылка.Пустая();
	Элементы.КомандаОткрытьПубликацию.Доступность = НЕ Объект.Ссылка.Пустая();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьВебАдреса(АдресТестовогоФайла) 
	
	#Если НЕ ВебКлиент Тогда
	
	ПутьДляСохранения = ПолучитьИмяВременногоФайла(".html");

	ПустойТекстовыйДокумент = Новый ТекстовыйДокумент;
	ПустойТекстовыйДокумент.Записать(ПутьДляСохранения);
	
	ПараметрыПолучения = Новый Структура();
	ПараметрыПолучения.Вставить("ПутьДляСохранения", ПутьДляСохранения);
	
	Результат = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(АдресТестовогоФайла, ПараметрыПолучения, Ложь);
	
	Если НЕ Результат.Статус Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При проверке предыдущего этапа настройки произошла ошибка.
			|Вернитесь назад к предыдущему этапу и проверьте правильность настройки.
			|Проверяемый адрес: %1 
			|Текст ошибки:
			|%2'"), АдресТестовогоФайла, Результат.СообщениеОбОшибке);
			
		ПоказатьПредупреждение(,ТекстОшибки);
		
	КонецЕсли;
	
	УдалитьФайлы(ПутьДляСохранения);		
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
